[
    {
      "id": "1",
      "title": "To Kill a Mockingbird",
      "description": "To Kill a Mockingbird, written by Harper Lee and published in 1960, is a classic American novel set in the Deep South during the 1930s. The story is narrated by a young girl named Scout Finch, who lives with her brother, Jem, and their widowed father, Atticus Finch, a principled lawyer. The novel explores themes of racial injustice, moral growth, and empathy through the eyes of Scout as she witnesses her father's defense of Tom Robinson, a Black man falsely accused of raping a white woman.",
      "author": "Harper Lee",
      "imageUrl": "https://m.media-amazon.com/images/I/81gepf1eMqL.AC_UF1000,1000_QL80.jpg",
      "category": "Classic",
      "rating": 4.8,
      "price": 11.99,
      "discount": 20,
      "amount": 12,
      "isBestDeal": true,
      "isTopBook": true,
      "isLatestBook": false,
      "isUpcomingBook": false
    },
    {
      "id": "2",
      "title": "1984",
      "description": "1984, written by George Orwell and published in 1949, is a dystopian novel set in a totalitarian society ruled by the Party, led by the figurehead Big Brother. The story follows Winston Smith, a low-ranking member of the Party who works at the Ministry of Truth, where he alters historical records to fit the Party’s narrative. In this oppressive regime, individualism is crushed, and constant surveillance is maintained through telescreens and the Thought Police, who monitor citizens for any signs of dissent.",
      "author": "George Orwell",
      "imageUrl": "https://m.media-amazon.com/images/I/61NAx5pd6XL.AC_UF1000,1000_QL80.jpg",
      "category": "Dystopian",
      "rating": 4.6,
      "price": 14.99,
      "discount": 0,
      "amount": 20,
      "isBestDeal": false,
      "isTopBook": true,
      "isLatestBook": false,
      "isUpcomingBook": false
    },
    {
      "id": "3",
      "title": "Pride and Prejudice",
      "description": "Pride and Prejudice, written by Jane Austen and published in 1813, is a classic novel that explores themes of love, social class, and individual agency in early 19th-century England. The story follows Elizabeth Bennet, one of five sisters in the Bennet family, as she navigates the complexities of society, romance, and her own personal growth.",
      "author": "Jane Austen",
      "imageUrl": "https://almabooks.com/wp-content/uploads/2016/10/9781847493699.jpg",
      "category": "Romance",
      "rating": 4.9,
      "price": 10.39,
      "discount": 20,
      "amount": 10,
      "isBestDeal": true,
      "isTopBook": false,
      "isLatestBook": false,
      "isUpcomingBook": false
    },
    {
      "id": "4",
      "title": "The Great Gatsby",
      "description": "The Great Gatsby, written by F. Scott Fitzgerald and published in 1925, is a classic American novel set in the Roaring Twenties. The story is narrated by Nick Carraway, who becomes entwined in the lives of his wealthy neighbors, particularly the enigmatic Jay Gatsby. Gatsby is known for his lavish parties and his obsessive love for Daisy Buchanan, Nick's cousin, who is married to the affluent but morally bankrupt Tom Buchanan.",
      "author": "F. Scott Fitzgerald",
      "imageUrl": "https://d28hgpri8am2if.cloudfront.net/book_images/onix/cvr9781524879761/the-great-gatsby-9781524879761_hr.jpg",
      "category": "Classic",
      "rating": 4.5,
      "price": 18.99,
      "discount": 0,
      "amount": 18,
      "isBestDeal": false,
      "isTopBook": true,
      "isLatestBook": false,
      "isUpcomingBook": true
    },
    {
      "id": "5",
      "title": "The Catcher in the Rye",
      "description": "The Catcher in the Rye, written by J.D. Salinger and published in 1951, is a coming-of-age novel that follows the experiences of Holden Caulfield, a disenchanted teenager who has just been expelled from a prestigious prep school. Set in New York City, the story is narrated by Holden himself as he recounts his thoughts and encounters over a few days, exploring themes of alienation, identity, and the challenges of adolescence.",
      "author": "J.D. Salinger",
      "imageUrl": "https://m.media-amazon.com/images/I/8125BDk3l9L.AC_UF1000,1000_QL80.jpg",
      "category": "Classic",
      "rating": 4.3,
      "price": 10.99,
      "discount": 0,
      "amount": 22,
      "isBestDeal": false,
      "isTopBook": false,
      "isLatestBook": true,
      "isUpcomingBook": false
    },
    {
      "id": "6",
      "title": "The Hobbit",
      "description": "The Hobbit, written by J.R.R. Tolkien and published in 1937, is a fantasy novel that follows the journey of Bilbo Baggins, a timid hobbit who lives a quiet life in the Shire. Bilbo's life is turned upside down when the wizard Gandalf and a group of thirteen dwarves, led by Thorin Oakenshield, enlist him as their burglar in a quest to reclaim their homeland and treasure from the dragon Smaug.",
      "author": "J.R.R. Tolkien",
      "imageUrl": "https://m.media-amazon.com/images/I/712cDO7d73L.AC_UF1000,1000_QL80.jpg",
      "category": "Fantasy",
      "rating": 4.8,
      "price": 12.79,
      "discount": 20,
      "amount": 30,
      "isBestDeal": true,
      "isTopBook": true,
      "isLatestBook": false,
      "isUpcomingBook": false
    },
    {
      "id": "7",
      "title": "The Da Vinci Code",
      "description": "The Da Vinci Code, written by Dan Brown and published in 2003, is a fast-paced thriller that follows symbologist Robert Langdon and cryptologist Sophie Neveu as they investigate a murder at the Louvre Museum in Paris. The victim, Jacques Saunière, leaves behind a series of cryptic clues that lead Langdon and Neveu on a quest through art, history, and religious symbolism.",
      "author": "Dan Brown",
      "imageUrl": "https://m.media-amazon.com/images/I/71y4X5150dL.AC_UF1000,1000_QL80.jpg",
      "category": "Thriller",
      "rating": 4.4,
      "price": 13.59,
      "discount": 20,
      "amount": 15,
      "isBestDeal": true,
      "isTopBook": false,
      "isLatestBook": false,
      "isUpcomingBook": false
    },
    {
      "id": "8",
      "title": "Harry Potter and the Sorcerer's Stone",
      "description":"Harry Potter and the Sorcerer's Stone, written by J.K. Rowling and published in 1997, is the first book in the beloved Harry Potter series. The story follows an eleven-year-old boy named Harry Potter, who discovers that he is a wizard on his birthday. After growing up with his neglectful relatives, the Dursleys, Harry receives an invitation to attend Hogwarts School of Witchcraft and Wizardry.",
      "author": "J.K. Rowling",
      "imageUrl": "https://m.media-amazon.com/images/I/81q77Q39nEL.AC_UF1000,1000_QL80.jpg",
      "category": "Fantasy",
      "rating": 4.9,
      "price": 16.99,
      "discount": 0,
      "amount": 25,
      "isBestDeal": false,
      "isTopBook": true,
      "isLatestBook": false,
      "isUpcomingBook": false
    },
    {
      "id": "9",
      "title": "The Hunger Games",
      "description": "The Hunger Games, written by Suzanne Collins and published in 2008, is a dystopian novel set in a future where the totalitarian nation of Panem is divided into twelve districts, each ruled by the oppressive Capitol. The story follows Katniss Everdeen, a resourceful sixteen-year-old girl from District 12, who volunteers to take her sister Prim’s place in the annual Hunger Games—a brutal televised competition in which one boy and one girl from each district must fight to the death until only one remains.",
      "author": "Suzanne Collins",
      "imageUrl": "https://m.media-amazon.com/images/I/71un2hI4mcL.AC_UF1000,1000_QL80.jpg",
      "category": "Dystopian",
      "rating": 4.7,
      "price": 17.99,
      "discount": 0,
      "amount": 19,
      "isBestDeal": false,
      "isTopBook": true,
      "isLatestBook": false,
      "isUpcomingBook": false
    },
    {
      "id": "10",
      "title": "The Fault in Our Stars",
      "description": "The Fault in Our Stars, written by John Green and published in 2012, is a poignant young adult novel that tells the story of Hazel Grace Lancaster, a sixteen-year-old girl living with cancer. Struggling with her illness, Hazel attends a support group where she meets Augustus Waters, a charming and witty boy who is in remission from osteosarcoma.",
      "author": "John Green",
      "imageUrl": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1660273739i/11870085.jpg",
      "category": "Romance",
      "rating": 4.6,
      "price": 12.99,
      "discount": 0,
      "amount": 30,
      "isBestDeal": false,
      "isTopBook": false,
      "isLatestBook": true,
      "isUpcomingBook": false
    },
    {
      "id": "11",
      "title": "Brave New World",
      "description": "Brave New World, written by Aldous Huxley and published in 1932, is a dystopian novel set in a technologically advanced future where society prioritizes stability and consumerism over individuality and emotional depth. In this world, humans are artificially created and conditioned to fit into predetermined roles, ensuring a rigid social order that suppresses personal freedoms and genuine relationships.",
      "author": "Aldous Huxley",
      "imageUrl": "https://m.media-amazon.com/images/I/81zE42gT3xL.AC_UF1000,1000_QL80.jpg",
      "category": "Dystopian",
      "rating": 4.2,
      "price": 14.99,
      "discount": 0,
      "amount": 25,
      "isBestDeal": false,
      "isTopBook": true,
      "isLatestBook": false,
      "isUpcomingBook": true
    },
    {
      "id": "12",
      "title": "The Girl on the Train",
      "description": "The Girl on the Train, written by Paula Hawkins and published in 2015, is a psychological thriller that follows the intertwining lives of three women. The story is narrated from the perspectives of Rachel Watson, Megan Hipwell, and Anna Boyle, whose lives become entangled in a web of secrets and deceit.",
      "author": "Paula Hawkins",
      "imageUrl": "https://m.media-amazon.com/images/I/71vWnStCnEL.AC_UF1000,1000_QL80.jpg",
      "category": "Thriller",
      "rating": 4.1,
      "price": 13.59,
      "discount": 0,
      "amount": 14,
      "isBestDeal": false,
      "isTopBook": false,
      "isLatestBook": true,
      "isUpcomingBook": false
    },
    {
      "id": "13",
      "title": "Little Women",
      "description": "Little Women, written by Louisa May Alcott and published in 1868, is a coming-of-age novel that follows the lives of the four March sisters—Meg, Jo, Beth, and Amy—as they navigate the challenges of adolescence and adulthood in Civil War-era America. Set in Concord, Massachusetts, the story is a poignant exploration of family, love, and the pursuit of individual dreams.",
      "author": "Louisa May Alcott",
      "imageUrl": "https://cdn.britannica.com/04/126004-050-EC4DF54F/Dustcover-Louisa-May-Alcott-Little-Women-novel.jpg",
      "category": "Classic",
      "rating": 4.8,
      "price": 12.49,
      "discount": 0,
      "amount": 16,
      "isBestDeal": false,
      "isTopBook": false,
      "isLatestBook": false,
      "isUpcomingBook": true
    },
    {
      "id": "14",
      "title": "The Handmaid's Tale",
      "description": "The Handmaid's Tale, written by Margaret Atwood and published in 1985, is a dystopian novel set in a totalitarian society known as Gilead, where a theocratic regime has overthrown the U.S. government. The story is narrated by Offred, a Handmaid whose sole purpose is to bear children for the ruling elite, reflecting the novel’s themes of oppression, gender, and identity.",
      "author": "Margaret Atwood",
      "imageUrl": "https://m.media-amazon.com/images/I/61su39k8NUL.AC_UF1000,1000_QL80.jpg",
      "category": "Dystopian",
      "rating": 4.7,
      "price": 15.99,
      "discount": 0,
      "amount": 12,
      "isBestDeal": false,
      "isTopBook": false,
      "isLatestBook": false,
      "isUpcomingBook": true
    },
    {
      "id": "15",
      "title": "Life of Pi",
      "description": "Life of Pi, written by Yann Martel and published in 2001, is a philosophical novel that tells the story of Piscine Molitor Patel, known as \"Pi,\" a young Indian boy who survives a shipwreck and is stranded on a lifeboat in the Pacific Ocean. The narrative begins with Pi’s upbringing in Pondicherry, India, where he is raised in a zoo run by his family. His love for animals and spirituality leads him to explore various religions, embracing Hinduism, Christianity, and Islam.",
      "author": "Yann Martel",
      "imageUrl": "https://m.media-amazon.com/images/I/81E9oNSK3bL.AC_UF1000,1000_QL80.jpg",
      "category": "Adventure",
      "rating": 4.6,
      "price": 14.99,
      "discount": 0,
      "amount": 8,
      "isBestDeal": false,
      "isTopBook": false,
      "isLatestBook": false,
      "isUpcomingBook": true
    },
    {
      "id": "16",
      "title": "Fahrenheit 451",
      "description": "Fahrenheit 451, written by Ray Bradbury and published in 1953, is a dystopian novel set in a future society where books are banned, and \"firemen\" are tasked with burning any that are found. The story follows Guy Montag, a fireman who becomes disillusioned with his society's anti-intellectualism and conformity",
      "author": "Ray Bradbury",
      "imageUrl": "https://m.media-amazon.com/images/I/61l8LHt4MeL.AC_UF1000,1000_QL80.jpg",
      "category": "Dystopian",
      "rating": 4.5,
      "price": 13.99,
      "discount": 0,
      "amount": 20,
      "isBestDeal": false,
      "isTopBook": false,
      "isLatestBook": true,
      "isUpcomingBook": false
    },
    {
      "id": "17",
      "title": "The Road",
      "description": "The Road, written by Cormac McCarthy and published in 2006, is a haunting post-apocalyptic novel that follows the journey of a father and his young son as they navigate a desolate and dangerous landscape after an unspecified cataclysmic event. The world is characterized by ash-covered ruins, barren trees, and a constant struggle for survival against the elements and other desperate survivors.",
      "author": "Cormac McCarthy",
      "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/2/27/The-road.jpg",
      "category": "Post-Apocalyptic",
      "rating": 4.3,
      "price": 12.99,
      "discount": 0,
      "amount": 10,
      "isBestDeal": false,
      "isTopBook": false,
      "isLatestBook": true,
      "isUpcomingBook": false
    },
    {
      "id": "18",
      "title": "The Name of the Wind",
      "description": "The Name of the Wind, written by Patrick Rothfuss and published in 2007, is the first novel in The Kingkiller Chronicle series. It tells the story of Kvothe, a legendary figure known for his extraordinary skills as a musician, magician, and warrior. The novel is framed as Kvothe’s own retelling of his life story to a chronicler, spanning his humble beginnings as an orphan in a traveling troupe to his time at the University, where he learns the arts of magic and alchemy.",
      "author": "Patrick Rothfuss",
      "imageUrl": "https://m.media-amazon.com/images/I/611iKJa7a-L.AC_UF894,1000_QL80.jpg",
      "category": "Fantasy",
      "rating": 4.9,
      "price": 12.99,
      "discount": 0,
      "amount": 20,
      "isBestDeal": true,
      "isTopBook": true,
      "isLatestBook": false,
      "isUpcomingBook": false
    },
    {
      "id": "19",
      "title": "Slaughterhouse-Five",
      "description": "Slaughterhouse-Five, written by Kurt Vonnegut and published in 1969, is a satirical and nonlinear novel that follows the life of Billy Pilgrim, an American soldier who becomes \"unstuck in time.\" The narrative shifts between various moments in Billy's life, including his experiences as a soldier during World War II, his capture by German forces, and his survival of the bombing of Dresden.",
      "author": "Kurt Vonnegut",
      "imageUrl": "https://m.media-amazon.com/images/I/817dhIc6E+L.AC_UF1000,1000_QL80.jpg",
      "category": "Sci-fi",
      "rating": 4.4,
      "price": 14.49,
      "discount": 0,
      "amount": 15,
      "isBestDeal": false,
      "isTopBook": false,
      "isLatestBook": false,
      "isUpcomingBook": true
    },
    {
      "id": "20",
      "title": "Crime and Punishment",
      "description": "Crime and Punishment, written by Fyodor Dostoevsky and published in 1866, is a profound psychological novel that explores the moral dilemmas faced by its protagonist, Rodion Raskolnikov. A former student living in poverty in St. Petersburg, Raskolnikov becomes obsessed with the idea that extraordinary individuals can transcend moral boundaries for a greater purpose. He theorizes that some people, like Napoleon, have the right to commit crimes if it leads to a significant benefit for humanity.",
      "author": "Fyodor Dostoevsky",
      "imageUrl": "https://m.media-amazon.com/images/I/71O2XIytdqL.AC_UF1000,1000_QL80.jpg",
      "category": "Classic",
      "rating": 4.7,
      "price": 16.99,
      "discount": 0,
      "amount": 7,
      "isBestDeal": false,
      "isTopBook": true,
      "isLatestBook": false,
      "isUpcomingBook": false
    }
  ]